#include "common.h"
// Файл ui_output.cpp
// Содержит функции для вывода таблицы
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Вывод шапки таблицы
void print_table_header() {
    printf("\n");
    printf("===================================================================================================================================================\n");
    printf("|  №  |   ID    |          Отправление           |          Назначение            | Время | Вагонов |   Минимальная цена   |   Максимальная цена  |\n");
    printf("===================================================================================================================================================\n");
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Вывод строки таблицы
// Аргументы: index - порядковый номер записи (начинаем с 0), train - структура с данными записи
void print_train_row(long long index, Train train) {
    printf("| %-3lld | %-7.7s | %-30.30s | %-30.30s | %-5d | %-7d | %-20g | %-20g |\n",
        index + 1, // Отображаем номер начиная с 1
        train.train_ID,
        train.departure_point,
        train.destination_point,
        train.travel_time,
        train.carriage_count,
        train.min_price,
        train.max_price);
    printf("===================================================================================================================================================\n");
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------
